{
	"version": "2.1.0",
	"notes": "{\"major\": [\"Renamed folders managed by IMM to better reflect their intended purpose.\", \"Batch operations mode to work on multiple mods/files together.\", \"Create custom categories & add custom images for categories.\", \"Unified folder selector for all games (via XXMI Launcher).\", \"Add support for Genshin Impact.\", \"Add daily backups of config files to recover data in case of a mishap.\"], \"minor\": [\"A help menu button appears when stuck on loading.\", \"Added a download speed indicator & ETA for downloads.\", \"Added a 'Launch' button to manually launch the game via XXMI.\", \"Added search & link functionality to quickly add sources to existing mods.\", \"Rate-limit mod update checks to avoid temporary IP block from gamebanana.\"], \"patch\": [\"Revamped hot-key display menu.\", \"Notes field size increased to match hot-key display.\", \"Toggle between hot-key display and notes.\"], \"notice\": {\"heading\": \"First Early Access Update!\", \"subheading\": \"If you'd like to try out the newest features early and help us by reporting any bugs you find, please enable pre-releases in the updates menu. Please remember this is an early release and may contain mistakes; normal users can expect a stable update in 1-2 days.\", \"ignoreable\": 2, \"timer\": 3, \"ver\": \"2.1.2\", \"id\": 0}, \"cn\": {\"major\": [\"修改了IMM管理的文件夹名称，以提高清晰度和组织性。\", \"批量操作模式，可同时处理多个模组/文件。\", \"创建自定义分类并为分类添加自定义图片。\", \"所有游戏的统一文件夹选择器（通过XXMI启动器）。\", \"添加对原神的支持。\", \"每日备份配置文件以防止数据丢失。\"], \"minor\": [\"在加载卡住时显示帮助菜单按钮。\", \"添加了下载速度指示器和预计到达时间。\", \"添加了'启动'按钮以通过XXMI手动启动游戏。\", \"添加了搜索和链接功能，可快速为现有模组添加来源。\", \"限制模组更新检查速率以避免GameBanana临时IP封禁。\"], \"patch\": [\"改进了热键显示菜单。\", \"备注字段大小增加以匹配热键显示。\", \"在热键显示和备注之间切换。\"], \"notice\": {\"heading\": \"首次抢先体验更新！\", \"subheading\": \"如果您想提前试用最新功能并通过报告发现的错误来帮助我们，请在更新菜单中启用预发布版本。请记住这是一个早期版本，可能包含错误；普通用户可以在1-2天内获得稳定更新。\", \"ignoreable\": 2, \"timer\": 3, \"ver\": \"2.1.2\", \"id\": 0}}, \"ru\": {\"major\": [\"Изменены имена папок, управляемых IMM, для большей ясности и организации.\", \"Режим пакетных операций для работы с несколькими модами/файлами одновременно.\", \"Создание пользовательских категорий и добавление пользовательских изображений для категорий.\", \"Единый селектор папок для всех игр (через XXMI Launcher).\", \"Добавлена поддержка Genshin Impact.\", \"Ежедневное резервное копирование файлов конфигурации для восстановления данных в случае сбоя.\"], \"minor\": [\"Кнопка меню справки появляется при зависании загрузки.\", \"Добавлен индикатор скорости загрузки и оценка времени прибытия.\", \"Добавлена кнопка 'Запустить' для ручного запуска игры через XXMI.\", \"Добавлена функция поиска и связывания для быстрого добавления источников к существующим модам.\", \"Ограничение скорости проверки обновлений модов для предотвращения временной блокировки IP от GameBanana.\"], \"patch\": [\"Обновлено меню отображения горячих клавиш.\", \"Размер поля для заметок увеличен в соответствии с отображением горячих клавиш.\", \"Переключение между отображением горячих клавиш и заметками.\"], \"notice\": {\"heading\": \"Первое обновление раннего доступа!\", \"subheading\": \"Если вы хотите попробовать новейшие функции заранее и помочь нам, сообщая об обнаруженных ошибках, пожалуйста, включите предварительные релизы в меню обновлений. Пожалуйста, помните, что это ранний релиз и может содержать ошибки; обычные пользователи могут ожидать стабильное обновление через 1-2 дня.\", \"ignoreable\": 2, \"timer\": 3, \"ver\": \"2.1.2\", \"id\": 0}}, \"jp\": {\"major\": [\"IMMが管理するフォルダー名を変更し、明瞭性と整理性を向上させました。\", \"複数のMod/ファイルを一括操作するバッチ操作モード。\", \"カスタムカテゴリを作成し、カテゴリにカスタム画像を追加。\", \"すべてのゲームに対応した統一フォルダセレクター（XXMI Launcher経由）。\", \"原神のサポートを追加。\", \"万が一に備えて設定ファイルの日次バックアップを追加。\"], \"minor\": [\"読み込み中に動かなくなった時にヘルプメニューボタンが表示されます。\", \"ダウンロード速度インジケーターとETAを追加。\", \"XXMIを介してゲームを手動で起動する'起動'ボタンを追加。\", \"既存のModにソースを素早く追加するための検索とリンク機能を追加。\", \"GameBananaからの一時的なIPブロックを回避するためにMod更新チェックをレート制限。\"], \"patch\": [\"ホットキー表示メニューを刷新。\", \"ノートフィールドのサイズをホットキー表示に合わせて増加。\", \"ホットキー表示とノート間の切り替え。\"], \"notice\": {\"heading\": \"初のアーリーアクセスアップデート！\", \"subheading\": \"最新機能を早期に試したい方、バグを報告して私たちを助けたい方は、アップデートメニューでプレリリースを有効にしてください。これは早期リリースであり、ミスが含まれる可能性があることを覚えておいてください。通常のユーザーは1-2日で安定したアップデートを期待できます。\", \"ignoreable\": 2, \"timer\": 3, \"ver\": \"2.1.2\", \"id\": 0}}, \"kr\": {\"major\": [\"IMM이 관리하는 폴더 이름을 변경하여 명확성과 구성을 개선했습니다.\", \"여러 모드/파일을 함께 작업할 수 있는 일괄 작업 모드.\", \"사용자 정의 카테고리 생성 및 카테고리에 사용자 정의 이미지 추가.\", \"모든 게임을 위한 통합 폴더 선택기 (XXMI Launcher를 통해).\", \"원신에 대한 지원 추가.\", \"문제 발생 시 데이터 복구를 위한 설정 파일 일일 백업 추가.\"], \"minor\": [\"로딩 중 멈췄을 때 도움말 메뉴 버튼이 나타납니다.\", \"다운로드 속도 표시기 및 ETA 추가.\", \"XXMI를 통해 게임을 수동으로 실행하는 '실행' 버튼 추가.\", \"기존 모드에 소스를 빠르게 추가할 수 있는 검색 및 링크 기능 추가.\", \"GameBanana의 임시 IP 차단을 방지하기 위해 모드 업데이트 확인 속도 제한.\"], \"patch\": [\"단축키 표시 메뉴 개선.\", \"단축키 표시에 맞춰 노트 필드 크기 증가.\", \"단축키 표시와 노트 간 전환.\"], \"notice\": {\"heading\": \"첫 얼리 액세스 업데이트!\", \"subheading\": \"최신 기능을 미리 사용해보고 발견한 버그를 보고하여 저희를 도와주고 싶으시다면 업데이트 메뉴에서 프리릴리스를 활성화해 주세요. 이것은 얼리 릴리스이며 실수가 포함될 수 있다는 점을 기억해 주세요. 일반 사용자는 1-2일 내에 안정적인 업데이트를 기대할 수 있습니다.\", \"ignoreable\": 2, \"timer\": 3, \"ver\": \"2.1.2\", \"id\": 0}}}",
	"pub_date": "2025-11-20T13:30:00Z",
	"platforms": {
		"windows-x86_64": {
			"signature": "",
			"url": "https://github.com/jpbhatt21/integrated-mod-manager/releases/latest/download/Integrated.Mod.Manager.IMM._2.1.0_x64-setup.exe"
		}
	}
}
